linux_study.org

 第二部分 Linux 文件、目录与磁盘格式
* 第六章、Linux 的文件权限与目录配置

* Linux 的使用者和群组

每个文件(夹)都有三类使用者: *拥有者(user)* / *群组(group)* / *其他人(other)* .

可以透过三类使用者, 设置三类权限: 拥有者对文件的权限 / 群组对文件的权限 / 其他人对文件的权限.

一个文件可以属于: *1* 个拥有者; *[1~N]* 个群组; *N* 个其他人.

| 账号信息 | /etc/passwd |
| 密码信息 | /etc/shadow |
| 群组信息 | /etc/group  |

特殊的使用者 root. 不属于拥有者/群组/其他人. root的权限无限大.

* Linux 文件权限的概念

* Linux 文件属性
通过 ls -l 命令, 可以查看文件信息(属性).
#+BEGIN_SRC sh
 -rw-r--r--   1   pi   pi   0   Oct 25 20:50  linux_study.org
 [    1   ]  [2][ 3 ][ 4 ][ 5 ][     6      ] [      7      ]     

 | 1 | 档案类型\权限 
 | 2 | 连结数 
 | 3 | 档案拥有着
 | 4 | 档案所属群组 
 | 5 | 档案容量  
 | 6 | 档案最后被修改日期
 | 7 | 档案名   
#+END_SRC
有哪些档案类型?
#+BEGIN_SRC 
 | - | 是文件
 | d | 是目录
 | l | 表示为连结档(link file)
 | b | 表示为装置文件里面的可供储存的接口设备(可随机存取装置)
 | c | 表示为装置文件里面的串行端口设备，例如键盘、鼠标(一次性读取装置)
#+END_SRC
* 如何改变文件属性与权限: chgrp, chown, chmod

* 目录与文件之权限意义

* Linux文件种类与扩展名
