linux_study.tex
% Created 2015-10-26 周一 20:12
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{\today}
\title{linux\_study}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

第二部分 Linux 文件、目录与磁盘格式
\section{第六章、Linux 的文件权限与目录配置}
\label{sec-1}

\subsection{Linux 的使用者和群组}
\label{sec-1-1}

每个文件(夹)都有三类使用者: \textbf{拥有者(user)} / \textbf{群组(group)} / \textbf{其他人(other)} .

可以透过三类使用者, 设置三类权限: 拥有者对文件的权限 / 群组对文件的权限 / 其他人对文件的权限.

一个文件可以属于: 1个拥有者; [1\textasciitilde{}N]个群组; N个其他人.

\begin{center}
\begin{tabular}{ll}
账号信息 & /etc/passwd\\
密码信息 & /etc/shadow\\
群组信息 & /etc/group\\
\end{tabular}
\end{center}

特殊的使用者 root. 不属于拥有者/群组/其他人. root的权限无限大.

\subsection{Linux 文件权限的概念}
\label{sec-1-2}

\subsubsection{Linux 文件属性}
\label{sec-1-2-1}
通过 ls -l 命令, 可以查看文件信息(属性).
\begin{verbatim}
-rw-r--r--   1   pi   pi   0   Oct 25 20:50  linux_study.org
[    1   ]  [2][ 3 ][ 4 ][ 5 ][     6      ] [      7      ]     

| 1 | 档案类型\权限 
| 2 | 连结数 
| 3 | 档案拥有着
| 4 | 档案所属群组 
| 5 | 档案容量  
| 6 | 档案最后被修改日期
| 7 | 档案名
\end{verbatim}

当为[ d ]则
当为[ - ]则
若是[ l ]则
若是[ b ]则
若是[ c ]则

有哪些档案类型?
\begin{center}
\begin{tabular}{ll}
- & 是文件\\
d & 是目录\\
l & 表示为连结档(link file)\\
b & 表示为装置文件里面的可供储存的接口设备(可随机存取装置)\\
c & 表示为装置文件里面的串行端口设备，例如键盘、鼠标(一次性读取装置)\\
\end{tabular}
\end{center}

\subsubsection{如何改变文件属性与权限: chgrp, chown, chmod}
\label{sec-1-2-2}

\subsubsection{目录与文件之权限意义}
\label{sec-1-2-3}

\subsubsection{Linux文件种类与扩展名}
\label{sec-1-2-4}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
